#### Import libraries

In [76]:

import pandas as pd
import numpy as numpy
import matplotlib.pyplot as plt
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"
from colorama import Fore, Back, Style 
color = Fore.YELLOW

#### Import data

In [72]:
# get books dataframe
b_cols = ['isbn', 'book_title' ,'book_author','year_of_publication', 'publisher', 'img_s', 'img_m', 'img_l']
books_df = pd.read_csv('Data/Book reviews/BX_Books.csv', sep=';', names = b_cols , encoding='latin-1',low_memory=False)
books_df = books_df.drop(books_df.index[0])

# About data
print(f'{color}Head of books dataframe:')
books_df.head(5)
print(f'{color}\nBooks dataframe description: ')
books_df.describe()
print(f'\n{color}Data type of each colum: ')
books_df.dtypes

Head of books dataframe:

,isbn,book_title,book_author,year_of_publication,publisher,img_s,img_m,img_l
1,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...
2,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...
3,0060973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...
4,0374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...
5,0393045218,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton & Company,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...

Books dataframe description:

,isbn,book_title,book_author,year_of_publication,publisher,img_s,img_m,img_l
count,271379,271379,271378,271379,271377,271379,271379,271379
unique,271379,242154,102028,116,16806,271063,271063,271063
top,0195153448,Selected Poems,Agatha Christie,2002,Harlequin,http://images.amazon.com/images/P/226401654X.0...,http://images.amazon.com/images/P/226401654X.0...,http://images.amazon.com/images/P/226401654X.0...
freq,1,27,632,17628,7536,2,2,2

Data type of each colum:

isbn                   object
book_title             object
book_author            object
year_of_publication    object
publisher              object
img_s                  object
img_m                  object
img_l                  object
dtype: object

In [73]:
# get users dataframe
u_cols = ['user_id', 'location', 'age']
users_df = pd.read_csv('Data/Book reviews/BX-Users.csv', sep=';',names = u_cols,encoding='latin-1',low_memory=False)
users_df = users_df.drop(users_df.index[0])

# About data
print(f'{color}Head of users dataframe:')
users_df.head(5)
print(f'{color}\nUsers dataframe description: ')
users_df.describe()
print(f'\n{color}Data type of each colum: ')
users_df.dtypes

Head of users dataframe:

  user_id                            location  age
1       1                  nyc, new york, usa  NaN
2       2           stockton, california, usa   18
3       3     moscow, yukon territory, russia  NaN
4       4           porto, v.n.gaia, portugal   17
5       5  farnborough, hants, united kingdom  NaN

Users dataframe description:

       user_id                         location     age
count   278858                           278858  168096
unique  278858                            57339     165
top          1  london, england, united kingdom      24
freq         1                             2506    5687

Data type of each colum:

user_id     object
location    object
age         object
dtype: object

In [74]:
r_cols = ['user_id', 'isbn', 'rating']
ratings_df = pd.read_csv('Data/Book reviews/BX-Book-Ratings.csv', sep=';', names=r_cols, encoding='latin-1',low_memory=False)
ratings_df = ratings_df.drop(ratings_df.index[0])
# About dataframe
print(f'{color}Head of ratings dataframe:')
ratings_df.head(5)
print(f'{color}\nRatings dataframe description: ')
ratings_df.describe()
print(f'\n{color}Data type of each colum: ')
ratings_df.dtypes

Head of ratings dataframe:

  user_id        isbn rating
1  276725  034545104X      0
2  276726  0155061224      5
3  276727  0446520802      0
4  276729  052165615X      3
5  276729  0521795028      6

Ratings dataframe description:

        user_id        isbn   rating
count   1149780     1149780  1149780
unique   105283      340556       11
top       11676  0971880107        0
freq      13602        2502   716109

Data type of each colum:

user_id    object
isbn       object
rating     object
dtype: object

#### Data Proccessing

In [77]:
# Change datatypes


# Users dataframe
users_df['age'] = users_df['age'].astype(float)
users_df['user_id'] = users_df['user_id'].astype(int)

# Ratings dataframe
ratings_df['user_id'] = ratings_df['user_id'].astype(int)
ratings_df['rating'] = ratings_df['rating'].astype(int)

# Books dataframe
books_df['year_of_publication'] = books_df['year_of_publication'].astype(int)